# PCBNetV4.yaml
# Dựa trên: Table 3 (cột PCBNetV4) và Figure 4 trong tài liệu
# Đặc điểm: Remove Y1, Y3, giảm 1/2 size kênh (width 0.125)

# Parameters
nc: 7 # số lượng class
scales:
  # [depth, width, max_channels]
  # Custom scale cho V4: width giảm từ 0.25 xuống 0.125
  n: [0.33, 0.125, 1024] 

# PCBNetV4 backbone (Cấu trúc giống V2 nhưng width scale sẽ làm nhỏ số kênh thực tế)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# PCBNetV4 head (Giống cấu trúc V2)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium) -> Y2 Prediction

  # Detect chỉ nhận đầu vào từ layer 18
  - [[18], 1, Detect, [nc]]