nc: 7
scales:

  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [32, 3, 2]]   # 0
  - [-1, 1, Conv, [64, 3, 2]]   # 1-P2/4 (Effective: 16 channels)
  - [-1, 3, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]  # 3
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 5
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]]     # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]   
  - [-1, 3, C2f, [256]]         

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [128]]         
 
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] 

  - [[18], 1, Detect, [nc]]